eisup_2019_docmng_integration/src/Documents/ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам/ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыПервичныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеБюджетныхАналитик</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФУ</name>
      <type>
        <types>CatalogRef.абс_ЦФУ</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяОборотов</name>
      <type>
        <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_ТипКонтрагента</name>
      <type>
        <types>CatalogRef.абс_ТипыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствиеБиллинговыхУслуг</name>
    <attributes>
      <name>ТипБиллинга</name>
      <type>
        <types>CatalogRef.абс_ТипыБиллинга</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеУслуги</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодУслугиБиллинга</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>этоМГМН</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/абс_СоответствиеНоменклатурыБюджетнымАналитикам/абс_СоответствиеНоменклатурыБюджетнымАналитикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СоответствиеНоменклатурыБюджетнымАналитикам</name>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТипКонтрагента</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяОборотов</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_СоответствиеБиллинговыхУслугНоменклатуре/абс_СоответствиеБиллинговыхУслугНоменклатуре.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СоответствиеБиллинговыхУслугНоменклатуре</name>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипБиллинга</name>
    <type>
      <types>CatalogRef.абс_ТипыБиллинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаименованиеУслуги</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодУслугиБиллинга</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>этоМГМН</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыПервичныхДокументов/абс_СтатусыПервичныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыПервичныхДокументов</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОФК</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаБухгалтером</name>
  </enumValues>
  <enumValues>
    <name>ДокументыПринятыБухгалтером</name>
    <comment>Обработка принятых документов (до оптимизации 2018)</comment>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>УточнениеОФК</name>
  </enumValues>
  <enumValues>
    <name>УточнениеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаДокумента</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРП_Источник</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРП_Приемник</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДиректоромДирекции</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаДанных</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаДанных</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДК</name>
    <comment>Департамент казначейства</comment>
  </enumValues>
  <enumValues>
    <name>СогласованиеОЭФ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЭкономистомКЦ</name>
  </enumValues>
  <enumValues>
    <name>БюджетныйКонтроль</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПДД</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам/ManagerModule.bsl
Процедура ЗаполнитьСписокДоступныхСтатусов(Список, Ссылка) Экспорт	
	
	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(глЗначениеПеременной("глТекущийПользователь"));
	
	Список.Очистить();
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Список.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Подготовка);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ссылка.Статус) Тогда
		Список.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Подготовка);
		Возврат;
    Иначе
		Список.Добавить(Ссылка.Статус);
	КонецЕсли;
	
	Если Ссылка.Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка Тогда
		Список.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.СогласованиеОФК);
		Список.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Отмена);
	ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусыПервичныхДокументов.СогласованиеОФК Тогда
		Если Не мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеДЭФ) = Неопределено Или
			 Не мРолиПользователя.Найти(Справочники.РолиИсполнителей.СуперПользователь) = Неопределено Тогда
			Список.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Согласован);
			Список.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Отказ);
		КонецЕсли;
	ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусыПервичныхДокументов.Отказ Тогда
		Список.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Отмена);
		Список.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Подготовка);
	ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусыПервичныхДокументов.Отмена Тогда
		Список.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Подготовка);		
	КонецЕсли;	
	
	Возврат;
	
КонецПроцедуры

Функция ЗаполнитьСоответствиеБюджетныхАналитик(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	абс_СоответствиеНоменклатурыБюджетнымАналитикам.Номенклатура,
		|	абс_СоответствиеНоменклатурыБюджетнымАналитикам.абс_ТипКонтрагента,
		|	абс_СоответствиеНоменклатурыБюджетнымАналитикам.Организация,
		|	абс_СоответствиеНоменклатурыБюджетнымАналитикам.СтатьяОборотов,
		|	абс_СоответствиеНоменклатурыБюджетнымАналитикам.ЦФО,
		|	абс_СоответствиеНоменклатурыБюджетнымАналитикам.абс_ЦФУ КАК ЦФУ,
		|	абс_СоответствиеНоменклатурыБюджетнымАналитикам.НоменклатурнаяГруппа
		|ИЗ
		|	РегистрСведений.абс_СоответствиеНоменклатурыБюджетнымАналитикам КАК абс_СоответствиеНоменклатурыБюджетнымАналитикам
		|ГДЕ
		|	абс_СоответствиеНоменклатурыБюджетнымАналитикам.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ЗаполнитьСоответствиеБиллинговыхУслуг(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	абс_СоответствиеБиллинговыхУслугНоменклатуре.Организация,
		|	абс_СоответствиеБиллинговыхУслугНоменклатуре.ТипБиллинга,
		|	абс_СоответствиеБиллинговыхУслугНоменклатуре.НаименованиеУслуги,
		|	абс_СоответствиеБиллинговыхУслугНоменклатуре.КодУслугиБиллинга,
		|	абс_СоответствиеБиллинговыхУслугНоменклатуре.Номенклатура,
		|	абс_СоответствиеБиллинговыхУслугНоменклатуре.этоМГМН
		|ИЗ
		|	РегистрСведений.абс_СоответствиеБиллинговыхУслугНоменклатуре КАК абс_СоответствиеБиллинговыхУслугНоменклатуре
		|ГДЕ
		|	абс_СоответствиеБиллинговыхУслугНоменклатуре.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
